Catalogs/Модификаторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Модификаторы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Положительный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Открыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Модификаторы/Ext/ManagerModule.bsl
// Возвращает случайный модификатор, который имеет признак положительности ПоложительныйВход.
//
// Параметры:
//  ПоложительныйВход - Булево - признак, что модификатор должен быть положительным.
//  Гсч   - ГенераторСлучайныхЧисел - генератор случайных чисел.
//  ИсключаемыеМодификаторыВход - Массив - массив ссылок на модификаторы, которые нужно исключить.
// 
// Возвращаемое значение:
//   - СправочникСсылка.Модификаторы - случайный модификатор.
//
Функция ВернутьМодификатор(ПоложительныйВход, Гсч, ИсключаемыеМодификаторыВход = Неопределено) Экспорт
	ПустойМодификатор = Справочники.Модификаторы.ПустаяСсылка();
	РезультатФункции = ПустойМодификатор;
	// Получим случайный модификатор, не помеченный на удаление, ориентируясь на признак положительного.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Модификаторы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Модификаторы КАК Модификаторы
	|ГДЕ
	|	НЕ Модификаторы.ПометкаУдаления
	|	И Модификаторы.Положительный = &ПоложительныйВход
	|	И Модификаторы.Открыт
	|	И НЕ Модификаторы.Ссылка В (&ИсключаемыеМодификаторы)";
	Запрос.УстановитьПараметр("ПоложительныйВход", ПоложительныйВход);
	Если ИсключаемыеМодификаторыВход <> Неопределено И ТипЗнч(ИсключаемыеМодификаторыВход) = Тип("Массив") Тогда
		Запрос.УстановитьПараметр("ИсключаемыеМодификаторы", ИсключаемыеМодификаторыВход);
	Иначе
		Запрос.УстановитьПараметр("ИсключаемыеМодификаторы", Новый Массив);
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		КоличествоВыборки = РезультатЗапроса.Выбрать().Количество();
		СлучайноеЧисло = Гсч.СлучайноеЧисло(0, КоличествоВыборки - 1);
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Счетчик = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			РезультатФункции = ВыборкаДетальныеЗаписи.Ссылка;
			Счетчик = Счетчик + 1;
			Если Счетчик = СлучайноеЧисло Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		// Не удалось получить модификатор. Вернём пустой.
		РезультатФункции = ПустойМодификатор;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции

// Возвращает массив ссылок на неоткрытые модификаторы.
//
// Возвращаемое значение:
//   - Массив — ссылки на модификаторы, у которых Открыт = Ложь.
//
Функция ПолучитьНеоткрытыеМодификаторы() Экспорт
	РезультатФункции = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Модификаторы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Модификаторы КАК Модификаторы
		|ГДЕ
		|	НЕ Модификаторы.Открыт";
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	РезультатФункции = Выгрузка.ВыгрузитьКолонку("Ссылка");
	Возврат РезультатФункции;
КонецФункции

// Открывает случайный модификатор, у которого признак Открыт = Ложь.
// Устанавливает Открыт = Истина и возвращает ссылку на модификатор.
// Если неоткрытых модификаторов нет — возвращает пустую ссылку.
//
// Возвращаемое значение:
//   - СправочникСсылка.Модификаторы — ссылка на открытый модификатор или пустая ссылка.
//
Функция ОткрытьСлучайныйМодификатор() Экспорт
	ПустойМодификатор = Справочники.Модификаторы.ПустаяСсылка();
	РезультатФункции = ПустойМодификатор;
	Гсч = Новый ГенераторСлучайныхЧисел;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Модификаторы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Модификаторы КАК Модификаторы
		|ГДЕ
		|	НЕ Модификаторы.Открыт
		|	И НЕ Модификаторы.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выгрузка = РезультатЗапроса.Выгрузить();
		МассивМодификаторов = Выгрузка.ВыгрузитьКолонку("Ссылка");
		СлучайныйИндекс = Гсч.СлучайноеЧисло(0, МассивМодификаторов.Количество() - 1);
		ВыбранныйМодификатор = МассивМодификаторов[СлучайныйИндекс];
		ОбъектМодификатора = ВыбранныйМодификатор.ПолучитьОбъект();
		ОбъектМодификатора.Открыт = Истина;
		ОбъектМодификатора.Записать();
		РезультатФункции = ВыбранныйМодификатор;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции

// Возвращает массив ссылок на открытые модификаторы.
//
// Возвращаемое значение:
//   - Массив — ссылки на модификаторы, у которых Открыт = Истина.
//
Функция ПолучитьОткрытыеМодификаторы() Экспорт
	РезультатФункции = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Модификаторы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Модификаторы КАК Модификаторы
		|ГДЕ
		|	Модификаторы.Открыт
		|	И НЕ Модификаторы.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	Модификаторы.Наименование";
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	РезультатФункции = Выгрузка.ВыгрузитьКолонку("Ссылка");
	Возврат РезультатФункции;
КонецФункции
